//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 岩田　輝
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct BUTTON
{
	XMFLOAT3	pos;		//ポリゴンの座標
	float		w, h;		//幅と高さ
	float		alpha;		//透明度
	int			texNo;		//使用しているテクスチャ番号
	int			selector;	//ボタン選択
};



struct SELECTOR
{
	XMFLOAT3	pos;		//ポリゴンの座標
	float		w, h;		//幅と高さ
	int			texNo;		//使用しているテクスチャ番号
};





//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);


